# **Sesión 2 - DataFrame y Series - Pandas**

## DataFrame

In [26]:
# 1. Importar librerías
import pandas as pd

In [27]:
# 3. Estructura de datos
# a. Diccionario de datos
datos = {"nombre": ["Roberto", "Vera", "Yolfer"], "edad": [23, 30, 40]}
datos

{'nombre': ['Roberto', 'Vera', 'Yolfer'], 'edad': [23, 30, 40]}

In [28]:
# Crear un DataFrame (tabla) a partir de un diccionario
df = pd.DataFrame(datos)
df

    nombre  edad
0  Roberto    23
1     Vera    30
2   Yolfer    40

In [29]:
# Mostrar la primera columna
df["nombre"]

0    Roberto
1       Vera
2     Yolfer
Name: nombre, dtype: object

In [30]:
# Otra forma de mostrar la primera serie
df.nombre

0    Roberto
1       Vera
2     Yolfer
Name: nombre, dtype: object

In [31]:
# Quiero conocer el tipo de elemento "nombre"
type(df.nombre)

pandas.core.series.Series

### Ejemplo: Importar datos de CSV

1. Leer los datos
2. Explora los datos
3. Limpiar los datos

In [32]:
# Importar la libreria
import pandas as pd
# from google.colan import drive #Para acceder al drive, si usara google colab
# drive.mount ("/content/drive") #Para acceder al drive, si usara google colab

In [ ]:
# 1. Leer el archivo csv
#df = pd.read_csv("/content/drive/MyDrive/Colab Notebooks/Precipitaciones.csv") #Para acceder al csv, si usara google colab
df = pd.read_csv("./Data/S2_Precipitaciones.csv")

In [34]:
type(df)

pandas.core.frame.DataFrame

In [35]:
# 2. Explorar los datos
df.head(10)

,region,enero,febrero,marzo,abril,mayo,junio,julio,agosto,septiembre,octubre,noviembre,diciembre,anual
0,A CORUNA,240.5,293.4,31.0,80.6,149.5,108.9,44.6,21.8,96.5,154.5,100.8,214.8,1536.9
1,ALBACETE,68.1,28.0,26.2,65.3,25.4,50.0,2.0,34.5,48.0,44.8,33.1,14.1,439.5
2,ALICANTE,49.2,3.7,63.2,85.8,57.2,20.0,9.2,5.0,44.0,41.1,47.4,1.8,427.6
3,ALMERIA,56.3,5.2,35.8,43.1,38.8,16.9,10.2,1.9,17.4,27.3,32.6,3.2,288.7
4,ARABA,96.8,79.9,38.0,52.0,37.7,107.8,8.5,17.7,63.3,38.5,212.2,197.3,949.7
5,ASTURIAS,196.9,138.4,34.4,73.1,67.4,131.2,22.5,19.2,90.3,74.2,309.8,205.3,1362.7
6,AVILA,67.6,104.5,5.6,83.4,25.7,44.4,5.5,14.2,97.9,91.7,33.9,47.5,621.9
7,BADAJOZ,62.2,78.5,7.7,61.3,13.0,29.6,0.0,2.7,80.5,77.6,10.2,59.3,482.6
8,ILLES BALEARS,81.2,5.3,53.9,22.0,54.4,28.5,8.8,10.0,73.2,55.6,229.9,18.1,640.9
9,BARCELONA,26.8,28.4,16.4,72.2,26.0,42.3,18.7,25.7,76.0,40.6,72.8,2.2,448.1

In [36]:
df.tail(10)

,region,enero,febrero,marzo,abril,mayo,junio,julio,agosto,septiembre,octubre,noviembre,diciembre,anual
42,SEGOVIA,63.3,80.5,3.3,88.5,39.8,55.6,6.3,14.4,47.1,62.5,42.9,44.8,549.0
43,SEVILLA,91.1,54.4,24.5,60.7,9.2,8.1,0.1,0.2,46.0,29.9,20.6,114.7,459.5
44,SORIA,75.1,63.5,12.1,67.7,70.7,85.4,10.5,19.4,56.5,47.0,62.9,37.7,608.5
45,TARRAGONA,52.7,28.4,9.7,59.6,19.0,63.8,22.4,43.5,88.7,25.4,115.0,5.1,533.3
46,TERUEL,54.1,28.8,11.9,74.6,48.5,72.6,26.8,48.1,55.0,30.9,60.0,13.2,524.5
47,TOLEDO,83.0,51.1,7.5,62.5,15.0,27.1,3.3,18.6,70.5,94.7,16.4,29.9,479.6
48,VALENCIA,61.9,16.8,49.3,86.4,33.8,34.2,17.1,30.9,99.3,46.1,46.6,5.5,527.9
49,VALLADOLID,29.2,69.1,4.1,65.1,24.3,58.3,1.9,3.8,54.1,40.2,41.7,35.9,427.7
50,ZAMORA,53.0,112.0,6.8,63.7,19.8,54.2,3.1,9.6,78.5,55.3,29.0,50.3,535.3
51,ZARAGOZA,52.0,30.0,3.6,52.7,38.3,57.5,13.5,13.2,61.5,27.4,76.6,23.4,449.7

In [37]:
# Consultar informacion general
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 52 entries, 0 to 51
Data columns (total 14 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   region      52 non-null     object
 1   enero       52 non-null     float64
 2   febrero     52 non-null     float64
 3   marzo       52 non-null     float64
 4   abril       52 non-null     float64
 5   mayo        52 non-null     float64
 6   junio       52 non-null     float64
 7   julio       52 non-null     float64
 8   agosto      52 non-null     float64
 9   septiembre  52 non-null     float64
 10  octubre     52 non-null     float64
 11  noviembre   52 non-null     float64
 12  diciembre   52 non-null     float64
 13  anual       52 non-null     float64
dtypes: float64(13), object(1)
memory usage: 5.8+ KB

### Lo del object es como algo general al almacenar, porque realmente siendo especificos es un string

In [38]:
# Conocer la cantiad de filas y columnas
df.shape

(52, 14)

In [39]:
# Conocer los encabezados
df.columns

Index(['region', 'enero', 'febrero', 'marzo', 'abril', 'mayo', 'junio',
       'julio', 'agosto', 'septiembre', 'octubre', 'noviembre', 'diciembre',
       'anual'],
      dtype='object')

In [40]:
# Ver algunas estadisticas (es como el "excel con estadistica, lo veremos mas adelante la parte estadistica")
df.describe()

,enero,febrero,marzo,abril,mayo,junio,julio,agosto,septiembre,octubre,noviembre,diciembre,anual
count,52.000000,52.000000,52.000000,52.000000,52.000000,52.000000,52.000000,52.000000,52.000000,52.000000,52.000000,52.000000,52.000000
mean,92.996154,78.632692,26.684615,64.500000,38.305769,54.182692,11.840385,17.178846,62.246154,54.373077,82.494231,76.192308,659.626923
std,57.127171,67.454280,31.473913,21.421942,29.079576,36.821635,13.256390,13.939496,28.581205,36.619785,91.689789,80.409042,352.905548
min,26.800000,2.300000,3.300000,3.500000,0.700000,1.100000,0.000000,0.000000,0.900000,1.000000,7.100000,1.800000,108.200000
25%,53.825000,32.825000,9.125000,53.950000,18.875000,26.325000,1.600000,4.850000,46.000000,29.825000,32.375000,22.075000,455.925000
50%,73.950000,62.600000,17.200000,62.700000,35.650000,50.400000,6.150000,16.500000,62.300000,46.550000,46.950000,47.950000,548.550000
75%,97.300000,102.550000,35.425000,77.625000,48.750000,78.025000,17.875000,26.550000,81.625000,74.500000,102.725000,107.000000,665.150000
max,261.900000,335.700000,209.800000,128.400000,149.500000,145.000000,46.800000,57.000000,122.800000,175.700000,384.600000,314.700000,1575.400000

In [41]:
df.iloc[1] #df.loc[1] # Aqui devuelve la fila 1

region        ALBACETE
enero             68.1
febrero           28.0
marzo             26.2
abril             65.3
mayo              25.4
junio             50.0
julio              2.0
agosto            34.5
septiembre        48.0
octubre           44.8
noviembre         33.1
diciembre         14.1
anual            439.5
Name: 1, dtype: object

## Series
Son estructuras con una dimension

In [42]:
# 1. Crear una serie a partir de una Lista
datos = [10,20,30,40,50] # esto es una lista, propio de Python
# 2. Crear la serie
serie = pd.Series(datos) # Lo que haces aqui es "de pandas creo una serie"
        #Objeto.Metodo()
serie #Llamando al objeto

# Beneficios de usar una serie en vez de una lista, es como una "columna pero con superpoderes"

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [43]:
# Operaciones con la serie
serie = serie + 3 # se ve simple, pero si lo hiciera solo con python, pues tendria que usar BUCLES
serie

0    13
1    23
2    33
3    43
4    53
dtype: int64

In [44]:
#Limpiar datos
data = {
    "id_producto":[1001,1002,1003,1003],
    "cantidad_vendida":[30,None,25,25],
    "precio":[20.50,15.0,None,22.5]
}
#Crear df
df = pd.DataFrame(data)

#Mostrar
df

   id_producto  cantidad_vendida  precio
0         1001              30.0    20.5
1         1002               NaN    15.0
2         1003              25.0     NaN
3         1003              25.0    22.5

In [45]:
# Explorar los datos
df.info()
#objeto.Metodo()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   id_producto       4 non-null      int64
 1   cantidad_vendida  3 non-null      float64
 2   precio            3 non-null      float64
dtypes: float64(2), int64(1)
memory usage: 228.0 bytes

In [46]:
# Verificar valores nulos
df.isnull()

   id_producto  cantidad_vendida  precio
0        False             False   False
1        False              True   False
2        False             False    True
3        False             False   False

In [47]:
# En caso de tener mucha data
df.isnull().sum()

id_producto         0
cantidad_vendida    1
precio              1
dtype: int64

In [48]:
#Eliminar los registros (filas) con datos nulos (vacios)
df_eliminados = df.dropna()
df_eliminados

   id_producto  cantidad_vendida  precio
0         1001              30.0    20.5
3         1003              25.0    22.5

Extra:

In [49]:
#Crear serie con indices personalizados
#a. Crear Lista
indice = ["a","b","c","d","e"] # si agregas una "f", se raya todo porque no matchea la cantidad de datos con indice
#b. Crear la serie
serie3 = pd.Series(datos,indice)
serie3

a    10
b    20
c    30
d    40
e    50
dtype: int64

In [50]:
#Acceder a un dato
serie3["c"] #Aqui devuelve la fila "c"

np.int64(30)